RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_usart.c
  USARTx->CTRL3 &= CTRL3_IRDALP_Mask;
  USARTx->CTRL3 |= USART_IrDAMode;
}

/**
  * @brief  Enables or disables the USART's IrDA interface.
  * @param  USARTx: Select the USART or the UART peripheral.
  *   This parameter can be one of the following values:
  *   USART1, USART2, USART3, UART4 or UART5.
  * @param  NewState: new state of the IrDA mode.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void USART_IrDACmd(USART_Type* USARTx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_USART_ALL_PERIPH(USARTx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the IrDA mode by setting the IREN bit in the CR3 register */
    USARTx->CTRL3 |= CTRL3_IRDAEN_Set;
  }
  else
  {
    /* Disable the IrDA mode by clearing the IREN bit in the CR3 register */
    USARTx->CTRL3 &= CTRL3_IRDAEN_Reset;
  }
}

/**
  * @brief  Checks whether the specified USART flag is set or not.
  * @param  USARTx: Select the USART or the UART peripheral.
  *   This parameter can be one of the following values:
  *   USART1, USART2, USART3, UART4 or UART5.
  * @param  USART_FLAG: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg USART_FLAG_CTSF:  CTS Change flag (not available for UART4 and UART5)
  *     @arg USART_FLAG_LBDF:  LIN Break detection flag
  *     @arg USART_FLAG_TDE:  Transmit data register empty flag
  *     @arg USART_FLAG_TRAC:   Transmission Complete flag
  *     @arg USART_FLAG_RDNE: Receive data register not empty flag
  *     @arg USART_FLAG_IDLEF: Idle Line detection flag
  *     @arg USART_FLAG_ORERR:  OverRun Error flag
  *     @arg USART_FLAG_NERR:   Noise Error flag
  *     @arg USART_FLAG_FERR:   Framing Error flag
  *     @arg USART_FLAG_PERR:   Parity Error flag
  * @retval The new state of USART_FLAG (SET or RESET).
  */
FlagStatus USART_GetFlagStatus(USART_Type* USARTx, uint16_t USART_FLAG)
{
  FlagStatus bitstatus = RESET;
  /* Check the parameters */
  assert_param(IS_USART_ALL_PERIPH(USARTx));
  assert_param(IS_USART_FLAG(USART_FLAG));

  /* The CTS flag is not available for UART4 and UART5 */
  if (USART_FLAG == USART_FLAG_CTSF)
  {
    assert_param(IS_USART_123_PERIPH(USARTx));
  }

  if ((USARTx->STS & USART_FLAG) != (uint16_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return bitstatus;
}

/**
  * @brief  Clears the USARTx's pending flags.
  * @param  USARTx: Select the USART or the UART peripheral.
  *   This parameter can be one of the following values:
  *   USART1, USART2, USART3, UART4 or UART5.
  * @param  USART_FLAG: specifies the flag to clear.
  *   This parameter can be any combination of the following values:
  *     @arg USART_FLAG_CTSF:  CTS Change flag (not available for UART4 and UART5).
  *     @arg USART_FLAG_LBDF:  LIN Break detection flag.
  *     @arg USART_FLAG_TRAC:   Transmission Complete flag.
  *     @arg USART_FLAG_RDNE: Receive data register not empty flag.
  *
  * @note
  *   - PE (Parity error), FE (Framing error), NE (Noise error), ORE (OverRun
  *     error) and IDLE (Idle line detected) flags are cleared by software
  *     sequence: a read operation to USART_SR register (USART_GetFlagStatus())
  *     followed by a read operation to USART_DR register (USART_ReceiveData()).
  *   - RXNE flag can be also cleared by a read to the USART_DR register
  *     (USART_ReceiveData()).
  *   - TC flag can be also cleared by software sequence: a read operation to
  *     USART_SR register (USART_GetFlagStatus()) followed by a write operation
  *     to USART_DR register (USART_SendData()).
  *   - TXE flag is cleared only by a write to the USART_DR register
  *     (USART_SendData()).
  * @retval None
  */
void USART_ClearFlag(USART_Type* USARTx, uint16_t USART_FLAG)
{
  /* Check the parameters */
  assert_param(IS_USART_ALL_PERIPH(USARTx));
  assert_param(IS_USART_CLEAR_FLAG(USART_FLAG));

  /* The CTS flag is not available for UART4 and UART5 */
  if ((USART_FLAG & USART_FLAG_CTSF) == USART_FLAG_CTSF)
  {
    assert_param(IS_USART_123_PERIPH(USARTx));
  }

  USARTx->STS = (uint16_t)~USART_FLAG;
}

/**
  * @brief  Checks whether the specified USART interrupt has occurred or not.
  * @param  USARTx: Select the USART or the UART peripheral.
  *   This parameter can be one of the following values:
  *   USART1, USART2, USART3, UART4 or UART5.
  * @param  USART_INT: specifies the USART interrupt source to check.
  *   This parameter can be one of the following values:
  *     @arg USART_INT_CTSF:  CTS change interrupt (not available for UART4 and UART5)
  *     @arg USART_INT_LBDF:  LIN Break detection interrupt
  *     @arg USART_INT_TDE:  Tansmit Data Register empty interrupt
  *     @arg USART_INT_TRAC:   Transmission complete interrupt
  *     @arg USART_INT_RDNE: Receive Data register not empty interrupt
  *     @arg USART_INT_IDLEF: Idle line detection interrupt
  *     @arg USART_INT_ORERR:  OverRun Error interrupt
  *     @arg USART_INT_NERR:   Noise Error interrupt
  *     @arg USART_INT_FERR:   Framing Error interrupt
  *     @arg USART_INT_PERR:   Parity Error interrupt
  * @retval The new state of USART_INT (SET or RESET).
  */
ITStatus USART_GetITStatus(USART_Type* USARTx, uint16_t USART_INT)
{
  uint32_t bitpos = 0x00, itmask = 0x00, usartreg = 0x00;
  ITStatus bitstatus = RESET;
  /* Check the parameters */
  assert_param(IS_USART_ALL_PERIPH(USARTx));
  assert_param(IS_USART_GET_INT(USART_INT));

  /* The CTS interrupt is not available for UART4 and UART5 */
  if (USART_INT == USART_INT_CTSF)
  {
    assert_param(IS_USART_123_PERIPH(USARTx));
  }

  /* Get the USART register index */
  usartreg = (((uint8_t)USART_INT) >> 0x05);
  /* Get the interrupt position */
  itmask = USART_INT & INT_Mask;
  itmask = (uint32_t)0x01 << itmask;

  if (usartreg == 0x01) /* The INT  is in CTRL1 register */
  {
    itmask &= USARTx->CTRL1;
  }
  else if (usartreg == 0x02) /* The INT  is in CTRL2 register */
  {
    itmask &= USARTx->CTRL2;
  }
  else /* The INT  is in CR3 register */
  {
    itmask &= USARTx->CTRL3;
  }

  bitpos = USART_INT >> 0x08;
  bitpos = (uint32_t)0x01 << bitpos;
  bitpos &= USARTx->STS;

  if ((itmask != (uint16_t)RESET) && (bitpos != (uint16_t)RESET))
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

